update diagrams of day 1 and day 2
